---
kind: other
id: Properties.T:Autodesk.Revit.DB.Mechanical.DuctSizeSettings
source: html/1080841e-2c73-f4de-b475-1fba66b0d7e5.htm
---
# DuctSizeSettings Properties

The id of the assembly instance to which the element belongs.